RaceHanyang/STM32F405R_Cooling_Control/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ErrorLED_Pin GPIO_PIN_13
#define ErrorLED_GPIO_Port GPIOC
#define _ADC1_IN5_Pin GPIO_PIN_5
#define _ADC1_IN5_GPIO_Port GPIOA
#define _ADC1_IN6_Pin GPIO_PIN_6
#define _ADC1_IN6_GPIO_Port GPIOA
#define Radiator1_INH_Pin GPIO_PIN_4
#define Radiator1_INH_GPIO_Port GPIOB
#define Waterpump1_INH_Pin GPIO_PIN_5
#define Waterpump1_INH_GPIO_Port GPIOB
#define Radiator0_INH_Pin GPIO_PIN_6
#define Radiator0_INH_GPIO_Port GPIOB
#define WaterPump0_INH_Pin GPIO_PIN_7
#define WaterPump0_INH_GPIO_Port GPIOB
#define ExternalFan_INH_Pin GPIO_PIN_8
#define ExternalFan_INH_GPIO_Port GPIOB
#define BlueLED_Pin GPIO_PIN_9
#define BlueLED_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
